trade_exp/src/InformationRegisters/Б_ОчередьПечати/Б_ОчередьПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1f5d803c-9e05-4613-8b06-b545dbdce834">
  <name>Б_ОчередьПечати</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="cca491ff-0db9-44a2-9c88-5b415aeba766">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="05383963-997a-42af-89cd-4abade5e4d90">
    <name>ИдЧекаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="27b1462d-9dbb-4d0b-a997-0bb1045ccd57">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыИзмеряемыхВеличин/ТипыИзмеряемыхВеличин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыИзмеряемыхВеличин</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39bca12a-73d8-4f63-b175-8d09e27f1889">
    <name>Энергия</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9fe5bd6a-0dc3-492a-8124-5d8374b7dc0f">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="166d8d12-5edc-4ab3-859d-fbfc26f1f783">
    <name>КоличествоШтук</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="03b65f12-3868-4b16-a177-ed2ec292ca2c">
    <name>Площадь</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae31522b-14d7-4a69-9cc9-ccad6a27391d">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="654bd14d-c881-4925-beea-5643856794e3">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="63b8d3ae-e98a-46bc-9820-21ca637b2ea5">
    <name>ЭлектрическийЗаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="755c3036-63aa-4cd7-bb48-ea6719b0f5f1">
    <name>Мощность</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="99ce385b-b097-477a-9cb5-30caba0dd9e5">
    <name>Время</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/КартыЛояльности/КартыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КартыЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.ВидыКартЛояльности</owners>
  <attributes>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МагнитныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="498b2f25-6aa5-4645-9e67-8fb628c230a2">
    <name>ПолнаяИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bed3672-f007-4c00-b791-0b7ebd647c22">
    <name>ИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91d3583a-c05d-459c-9f83-fbfeb62fca07">
    <name>ДатаОбновленияДанныхФНС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9905e69a-09d1-4783-b0d4-a021c2f92565">
    <name>Выручка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d17fbf5-4cee-45fc-8af7-13db85700ccc">
    <name>ПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df919cae-c1ba-4fe1-972e-d4222ab0005d">
    <name>КоличествоРаботников</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0800e2e-b103-41a7-a887-ca049af6677e">
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5729a90-7b03-4912-9990-210602af51f1">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="2629d638-1c9b-4112-b68e-0560bb2d997b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c62fe487-31b1-4ebb-b1a8-ad1821952696">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9a6552a-9493-4353-953b-2f7c777b2f61">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="21ef8fb5-99ad-409e-9d21-398379db456f">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72d876b9-29ff-4c5d-bb87-ac07cd9adf4b">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9ee408c3-a4d4-4570-bc13-b6b4193f889a">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="689cf9d5-3c38-4e84-8e8e-c5bad88bbac8">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="48ac22c5-5bfb-458e-a816-f8ebffd836d8">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7ceb314a-6d3d-4eb9-927d-ec92d5e2ffd3">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="055bd074-c785-404d-a8d5-827b2754f483">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7027a1ee-60c1-471c-aee1-a34bdb899465">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="366f1557-22c4-4832-947b-6020579affac">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="09809d0f-5b0e-46d3-b7b7-24065f75b724">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa7aa1c6-abc3-4421-b0ea-7d82a073d157">
      <name>ДействуетС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="07295009-77c8-4b40-8a9e-62debe0887c6">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f624df26-f68d-4892-b33d-cf2ef3cdaa0c">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="987ffccd-246d-49b8-a223-e53d76678887">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="861931ca-dadf-424e-9e87-cc6fec41bf47">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3fe16d0-c615-4822-a095-1678933639d4">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonModules/Б_ОбменССайтомСервер/Module.bsl
&ИзменениеИКонтроль("ДобавитьОсновныеНастройкиВПараметры")
Функция Док_ДобавитьОсновныеНастройкиВПараметры(УзелОбмена, Параметры) Экспорт

	МассивРеквизитов = ПолучитьМассивРеквизитов5ВерсииМодуля();

	//добавляем реквизиты узла обмена
	Для каждого ТекРеквизит из УзелОбмена.Метаданные().Реквизиты Цикл

		Если МассивРеквизитов.Найти(ТекРеквизит.Имя) = Неопределено тогда
			Продолжить;
		КонецЕсли;         

		Параметры.Вставить(ТекРеквизит.Имя, УзелОбмена[ТекРеквизит.Имя]);
	КонецЦикла;

	//Добавляем свойства, которые используем в обмене
	Параметры.Вставить("СвойствоИдМетодаОплаты", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Метод оплаты ИД", Истина));
	Параметры.Вставить("СвойствоИдентификаторОтправления", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Идентификатор отправления", Ложь));

	Параметры.Вставить("ЕстьКритичныеОшибкиВОбмене"	, Ложь);
	Параметры.Вставить("ОбменВыполненБезОшибок"		, Истина);

	лфайлСхемыXSD 	= ПолучитьИмяВременногоФайла(".XSD");
	СхемаXSD  		= ПланыОбмена.Б_ОбменССайтом.ПолучитьМакет("СхемаXSDОбмена");
	СхемаXSD.Записать(лфайлСхемыXSD);

	Параметры.Вставить("ПространствоИмен", "urn:1C.ru:commerceml_3");
	Параметры.Вставить("МояФабрикаXDTO", );

	Параметры.Вставить("ВерсияСхемы"		, "3.1");
	Параметры.Вставить("ФайлСхемы"			, лфайлСхемыXSD);

#Удаление
	Параметры.Вставить("ФорматСуммы"		, "ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=");
#КонецУдаления
#Вставка
	Параметры.Вставить("ФорматСуммы"		, "ЧЦ=18; ЧДЦ=4; ЧРД=.; ЧН=; ЧГ=");
#КонецВставки
	Параметры.Вставить("ФорматКоличества"	, "ЧРД=.; ЧН=; ЧГ=");

	Параметры.Вставить("Ссылка"				, УзелОбмена);

	Параметры.Вставить("ИдентификаторОбмена", Строка(Новый УникальныйИдентификатор)); 

	Параметры.Вставить("ПрефиксВерсии"		, Строка(Формат(ТекущаяДатаСеанса()-НачалоДня(ТекущаяДатаСеанса()), "ЧГ=0"))); 
	
	Параметры.Вставить("ИспользоватьПартнеровИКонтрагентов"	, ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов"));
	Параметры.Вставить("ИспользоватьУпаковкиНоменклатуры"	, ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры"));
	
	Параметры.Вставить("ИспользоватьРучныеСкидкиВПродажах"	, ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах"));
	Параметры.Вставить("ИспользоватьАвтоматическиеСкидкиВПродажах"	, ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах"));
	
	Параметры.Вставить("СтруктураСхемКомпоновки"		, ПолучитьСтруктуруСхемКомпоновки());
	
	Параметры.Вставить("УдалениеНеВыгружаемыхДанных"	, УзелОбмена.УдалениеНеВыгружаемыхДанных);
	
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПлатформаWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;

	Параметры.Вставить("ПлатформаWindows", ПлатформаWindows);

	ДатаФормирования = ТекущаяДатаСеанса();
	Параметры.Вставить("ДатаФормирования", ДатаФормирования);

	//добавляем расширения картинок
	РазрешенныеТипыКартинок = Новый Массив;
	РазрешенныеТипыКартинок.Добавить("gif");
	РазрешенныеТипыКартинок.Добавить("jpg");
	РазрешенныеТипыКартинок.Добавить("jpeg");
	РазрешенныеТипыКартинок.Добавить("png");
	РазрешенныеТипыКартинок.Добавить(".gif");
	РазрешенныеТипыКартинок.Добавить(".jpg");
	РазрешенныеТипыКартинок.Добавить(".jpeg");
	РазрешенныеТипыКартинок.Добавить(".png");
	РазрешенныеТипыКартинок.Добавить("");
	Параметры.Вставить("РасширенияКартинок", РазрешенныеТипыКартинок);

	Параметры.НастройкаВерсионностиВыгружаемыхДанных = УзелОбмена.НастройкаВерсионностиВыгружаемыхДанных.Получить();  	

	Параметры.Вставить("ДатаДеактивацииПриПакетнойВыгрузке"		, Неопределено);

	//добавляем  данные для логирования
	Если Параметры.КаталогЛога = "" тогда

		//Сообщить("Для настройки не задан каталог хранения лога. Лог будет храниться в каталоге выгрузки файлов.");

		Параметры.КаталогЛога = Параметры.КаталогВыгрузки;

		Если Параметры.КаталогЛога = "" тогда
			//Сообщить("Не удалось указать каталог выгрузки в качестве каталога хранения лога. Ведение лога невозможно.");
		КонецЕсли;

	КонецЕсли;

	ИмяФайлаЛога = "";

	Если НЕ ПустаяСтрока(Параметры.КаталогЛога) Тогда

		лКаталогЛога = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, Параметры.КаталогЛога + "\reports"); 

		Если НЕ Б_ОбщиеПроцедурыИФункцииСервер.СуществуетФайл(лКаталогЛога) тогда
			СоздатьКаталог(лКаталогЛога);	
		КонецЕсли;
#Удаление
		ИмяФайлаЛога = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, лКаталогЛога + "\") + "Exchange_" + "(" + УзелОбмена.Наименование +  ")" +  СокрЛП(Формат(Параметры.ДатаФормирования, "ДФ=yyyy-MM-dd")) + ".txt";
#КонецУдаления
#Вставка
		Если Параметры.Свойство("ВыгрузкаОтдельныхДокументов") Тогда  
			ИмяФайлаЛога = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, лКаталогЛога + "\") + "Exchange_" + "(" + УзелОбмена.Наименование + " выгрузка отдельных документов" + ")" +  СокрЛП(Формат(Параметры.ДатаФормирования, "ДФ=yyyy-MM-dd")) + ".txt";
		Иначе	
			ИмяФайлаЛога = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, лКаталогЛога + "\") + "Exchange_" + "(" + УзелОбмена.Наименование +  ")" +  СокрЛП(Формат(Параметры.ДатаФормирования, "ДФ=yyyy-MM-dd")) + ".txt";
		КонецЕсли; 
#КонецВставки

	КонецЕсли;

	Параметры.Вставить("ИмяФайлаЛога"		, ИмяФайлаЛога);
	Параметры.Вставить("КодировкаФайлаЛога"	, УзелОбмена.КодировкаФайлаЛога);
	
	Параметры.Вставить("ИспользуетсяЦенообразование25", ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25"));
	Параметры.Вставить("ИспользуетсяЦенообразование20", ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование20"));

	Возврат Истина;

КонецФункции

&ИзменениеИКонтроль("ПолучениеОбъектаПоКоду")
Функция Док_ПолучениеОбъектаПоКоду(Код, ТипОбъекта, ИмяОбъекта, ТаблицаКэша)

	Результат = Неопределено;

	Если ТаблицаКэша <> Неопределено тогда

		НайденнаяСтрока = ТаблицаКэша.Найти(Код, "Ид");

		Если НайденнаяСтрока <> Неопределено тогда
			Результат = НайденнаяСтрока.Ссылка;	
		КонецЕсли;

	КонецЕсли; 	

	Если Результат = Неопределено тогда
		Попытка
			Результат = XMLЗначение(Тип(ТипОбъекта), Код);
		Исключение
			Результат = Неопределено;
		КонецПопытки;
	КонецЕсли;

	Если Результат <> Неопределено тогда
		Результат = ?(СокрЛП(Результат.ВерсияДанных) = "", Неопределено, Результат);
#Вставка
		СообщитьПодробно("!!! Не задана версия данных Б_ОбменССайтомСервер",, Истина,, Истина);
#КонецВставки
	КонецЕсли;

	Если Результат = Неопределено и ИмяОбъекта <> "" тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Справочник.Ссылка
		|ИЗ
		|	" + ИмяОбъекта + " КАК Справочник
		|ГДЕ
		|	Справочник.Б_Идентификатор = &Идентификатор";
		запрос.УстановитьПараметр("Идентификатор",Код);
		тзнВрем = запрос.Выполнить().Выгрузить();
		Если тзнВрем.Количество() > 0 тогда
			Результат = тзнВрем[0].Ссылка; 	   
		КонецЕсли;
	КонецЕсли;

	Если Результат <> Неопределено тогда
		Результат = ?(СокрЛП(Результат.ВерсияДанных) = "", Неопределено, Результат);
#Вставка
		СообщитьПодробно("!!! Не задана версия данных Б_ОбменССайтомСервер",, Истина,, Истина);
#КонецВставки
	КонецЕсли;

	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ЗаданиеОбменССайтом")
Процедура Док_ЗаданиеОбменССайтом(КодНастройки)

#Вставка
	Отбор=Новый Структура();
	Отбор.Вставить("Состояние",СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("Ключ","c23b24e1-ecb7-45ea-a362-63abc678fd11"); 
	МассивЗаданий=ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);	
	если МассивЗаданий.Количество()>1 тогда
		возврат;
	конецесли;	
#КонецВставки

	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОбмена = ПланыОбмена.Б_ОбменССайтом.НайтиПоКоду(КодНастройки);

	Если НЕ ЗначениеЗаполнено(ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ПараметрыОбмена.ИспользоватьРегламентныеЗадания Тогда
		Возврат;
	КонецЕсли;

	Попытка    //замедляется скорость, но попробуем. Если не нужно - можно закоментить
		ВыполнитьОбмен(ПараметрыОбмена);
	Исключение
		Б_ОбменССайтомСервер.ДобавитьИнформациюООшибкеВОбмене(ПараметрыОбмена, ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&ИзменениеИКонтроль("ЗарегистрироватьИзменения")
Процедура Док_ЗарегистрироватьИзменения(Объект, Замещение)

	УстановитьПривилегированныйРежим(Истина);

	ТипОбъекта 		 = ТипЗнч(Объект);
	ИзмененияЗарегестрированы = Ложь;

	// Регистрация типовых справочников
	Если ТипОбъекта = Тип("СправочникОбъект.КартыЛояльности") 
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.СкидкиНаценки") 
		ИЛИ ТипОбъекта = Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения") тогда 

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения") тогда 

		Если Объект.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук Тогда

			ИзмененияЗарегестрированы = Истина;

			МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);
		Иначе

			ИзмененияЗарегестрированы = Истина;

			МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

			ТипВладельца = ТипЗнч(Объект.Владелец);

			Если ТипВладельца = Тип("СправочникСсылка.Номенклатура") Тогда

				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Владелец);

			Иначе

				Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Номенклатура.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.НаборУпаковок = &НаборУпаковок");

				Запрос.УстановитьПараметр("НаборУпаковок", Объект.Владелец);

				Выборка = Запрос.Выполнить().Выбрать();

				Пока Выборка.Следующий() Цикл

					ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Выборка.Ссылка);

				КонецЦикла;

			КонецЕсли;

		КонецЕсли;

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Файлы") ИЛИ ТипОбъекта = Тип("СправочникОбъект.Номенклатура") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);

		ПроверитьОбъектНаУчастиеВСвойствахИДобавитьСвойствоВУзел(МассивУзловТовары, ТипЗнч(Объект.Ссылка));	

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Б_ПользовательскиеГруппыТоваров") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Б_ПользовательскиеГруппыТоваровТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВремТовары
		|ИЗ
		|	Справочник.Б_ПользовательскиеГруппыТоваров.Товары КАК Б_ПользовательскиеГруппыТоваровТовары
		|ГДЕ
		|	Б_ПользовательскиеГруппыТоваровТовары.Ссылка В ИЕРАРХИИ(&Раздел)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВремТовары.Номенклатура
		|			ИЗ
		|				ВремТовары)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВремТовары");

		Запрос.УстановитьПараметр("Раздел", Объект.Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Выборка.Ссылка);
		КонецЦикла;	

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ДоговорыКонтрагентов") 
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.НаправленияДеятельности")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.СтруктураПредприятия")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Валюты")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Склады")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.СтраныМира")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.СегментыНоменклатуры")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.СегментыПартнеров")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Организации")
		ИЛИ ТипОбъекта = Тип("СправочникОбъект.Проекты") Тогда

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		ПроверитьОбъектНаУчастиеВСвойствахИДобавитьСвойствоВУзел(МассивУзловТовары, ТипЗнч(Объект.Ссылка));	

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ЗначенияСвойствОбъектов") ИЛИ ТипОбъекта = Тип("СправочникОбъект.ЗначенияСвойствОбъектовИерархия")Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Владелец);

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ВидыКартЛояльности") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыЛояльности.Ссылка КАК КартаЛояльности
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Владелец = &ВидКарты";
		Запрос.УстановитьПараметр("ВидКарты",Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Выборка.КартаЛояльности);
		КонецЦикла;

		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.УсловияПредоставленияСкидокНаценок") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СкидкиНаценкиУсловияПредоставления.Ссылка КАК Скидка
		|ИЗ
		|	Справочник.СкидкиНаценки.УсловияПредоставления КАК СкидкиНаценкиУсловияПредоставления
		|ГДЕ
		|	СкидкиНаценкиУсловияПредоставления.УсловиеПредоставления = &Условие";
		Запрос.УстановитьПараметр("Условие",Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Выборка.Скидка);
		КонецЦикла;

		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Контрагенты") Тогда

		ИзмененияЗарегестрированы = Истина;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов") тогда

			МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);

			ПроверитьОбъектНаУчастиеВСвойствахИДобавитьСвойствоВУзел(МассивУзловТовары, ТипЗнч(Объект.Ссылка));	

		КонецЕсли;

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Партнеры") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
		Запрос.УстановитьПараметр("Партнер",Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Выборка.Контрагент);
		КонецЦикла;

		ПроверитьОбъектНаУчастиеВСвойствахИДобавитьСвойствоВУзел(МассивУзловТовары, ТипЗнч(Объект.Ссылка));	

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.НоменклатураПрисоединенныеФайлы") Тогда

		ИзмененияЗарегестрированы = Истина;

		Если ТипЗнч(Объект.ВладелецФайла) = Тип("СправочникСсылка.Номенклатура") Тогда

			МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.ВладелецФайла);
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);

		КонецЕсли;

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Ссылка);
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Номенклатура);

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ХарактеристикиНоменклатуры")Тогда			

		ИзмененияЗарегестрированы = Истина;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда

			МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

			Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда 

				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Объект.Владелец);

			Иначе

				Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Номенклатура.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
				|	И (НЕ Номенклатура.ЭтоГруппа)");

				Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.Владелец);

				Выборка = Запрос.Выполнить().Выбрать();

				Пока Выборка.Следующий() Цикл

					ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Выборка.Ссылка);

				КонецЦикла;

			КонецЕсли;

		КонецЕсли;

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ВидыНоменклатуры") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидНоменклатуры = &Группа");

		Запрос.УстановитьПараметр("Группа", Объект.Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл

			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Выборка.Ссылка);

		КонецЦикла;

		//Регистрация регистров  

	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ФискальныеОперации") тогда

		МассивУзловЗаказы = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(,Истина);

		Для каждого Запись Из Объект Цикл

			лТипДокумента = ТипЗнч(Запись.ДокументОснование);

			Если лТипДокумента = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") ИЛИ лТипДокумента = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") тогда

				Выборка = РегистрыСведений.Б_ОчередьПечати.Выбрать(Новый Структура("Документ", Запись.ДокументОснование));
				Пока Выборка.Следующий() Цикл
					лЗаписьОЧеке = Выборка.ПолучитьМенеджерЗаписи();
					лЗаписьОЧеке.Статус = 3;
					лЗаписьОЧеке.Записать();
				КонецЦикла;

				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловЗаказы, Запись.ДокументОснование);
			КонецЕсли;

		КонецЦикла;
#Удаление
		ИначеЕсли ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ТоварыКОтгрузке")
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры")    
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры25")    
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.РаспределениеЗапасов")
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.НоменклатураСегмента")
		ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ЗаказыПоставщикам")
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ШтрихКодыНоменклатуры") Тогда
#КонецУдаления
#Вставка
		ИначеЕсли
		ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры")    
		ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.РаспределениеЗапасовДвижения")  
		ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ЗапасыИПотребности") Тогда 
		
#КонецВставки
			
		ИзмененияЗарегестрированы = Истина;

		МассивУзловТовары = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(Истина);

		Если Замещение Тогда

			ОбъектМетаданных = Объект.Метаданные();

			ИмяБазовогоТипа = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);

			Если ИмяБазовогоТипа = "РегистрыСведений" Тогда

				СтарыйНаборЗаписей = РегистрыСведений[ОбъектМетаданных.Имя].СоздатьНаборЗаписей();

			ИначеЕсли ИмяБазовогоТипа = "РегистрыНакопления" Тогда

				СтарыйНаборЗаписей = РегистрыНакопления[ОбъектМетаданных.Имя].СоздатьНаборЗаписей();

			Иначе

				УстановитьПривилегированныйРежим(Ложь);

				Возврат;

			КонецЕсли;

			Для Каждого ЗначениеОтбора Из Объект.Отбор Цикл

				Если ЗначениеОтбора.Использование = Ложь Тогда
					Продолжить;
				КонецЕсли;

				СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
				СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
				СтрокаОтбора.Использование = Истина;

			КонецЦикла;

			СтарыйНаборЗаписей.Прочитать();
#Вставка
			Если ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.РаспределениеЗапасовДвижения") тогда 
				ЗарегистрироватьРасхожденияРегистраРаспределенияЗапасов(СтарыйНаборЗаписей,Объект,МассивУзловТовары);
				УстановитьПривилегированныйРежим(Ложь);  
				Возврат;
			КонецЕсли;         
#КонецВставки
			Для каждого Запись Из СтарыйНаборЗаписей Цикл
#Вставка 
				// Записи регистра Распредление запасов регистрируются, только если они влияют на свободный остаток.
				Если ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.РаспределениеЗапасов") Тогда
					Если Запись.Свободно = 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
#КонецВставки

				Если ЗначениеЗаполнено(Запись.Номенклатура) тогда                           
					ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Запись.Номенклатура);
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

		Для каждого Запись Из Объект Цикл
#Вставка 
			// Записи регистра Распредление запасов регистрируются, только если они влияют на свободный остаток.
			Если ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.РаспределениеЗапасов") Тогда
				Если Запись.Свободно = 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
#КонецВставки

			Если ЗначениеЗаполнено(Запись.Номенклатура) тогда     
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, Запись.Номенклатура);
			КонецЕсли;

		КонецЦикла;

	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.Б_СвойстваТоваровДокументов") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловЗаказы = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(,Истина);

		Для каждого Запись Из Объект Цикл

			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловЗаказы, Запись.Документ);

		КонецЦикла;

	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.СостоянияЗаказовКлиентов") Тогда 
		ИзмененияЗарегестрированы = Истина;

		МассивУзловЗаказы = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(,Истина);

		Для каждого Запись Из Объект Цикл
			Если ТипЗнч(Запись.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") тогда
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловЗаказы, Запись.Заказ);
			КонецЕсли;
		КонецЦикла;

#Удаление
		ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ ТипОбъекта = Тип("ДокументОбъект.РеализацияТоваровУслуг")
#КонецУдаления
#Вставка
		ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.РеализацияТоваровУслуг")
#КонецВставки
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") ИЛИ ТипОбъекта = Тип("ДокументОбъект.ОперацияПоПлатежнойКарте") 
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда

		ИзмененияЗарегестрированы = Истина;

		МассивУзловЗаказы = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(,Истина);

		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловЗаказы, Объект.Ссылка);

#Вставка	
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		Альтерра= Справочники.Организации.НайтиПоРеквизиту("ИНН", "2208015955");
		Если (Объект.Ссылка.ССайта ИЛИ Объект.Ссылка.ПередатьНаСайт) И (Объект.Ссылка.Организация = Альтерра) И (Не Объект.КоммерческоеПредложение) Тогда
			ИзмененияЗарегестрированы = Истина;

			МассивУзловЗаказы = Б_ОбменССайтомСерверПовтИсп.ПолучитьМассивУзловДляРегистрации(,Истина);

			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловЗаказы, Объект.Ссылка);
		КонецЕсли;
#КонецВставки
	КонецЕсли;

	Если НЕ ИзмененияЗарегестрированы тогда
		// Регистрация пользовательских справочников
		Попытка
			Выборка = планыОбмена.Б_ОбменССайтом.Выбрать();

			Пока Выборка.Следующий() Цикл

				Если Выборка.ОбменПользовательскимиСправочниками Тогда

					СохраненныеНастройки = Выборка.СохраненныеНастройки.Получить();

					ВремТзн = СохраненныеНастройки.ПользовательскиеСправочники.ВыгружаемыеПоляСправочников.Скопировать();
					ВремТзн.Свернуть("Справочник");

					Для Каждого ТекСправочник из ВремТзн Цикл

						Если ТипОбъекта = Тип("СправочникОбъект." + ТекСправочник.Справочник) тогда

							ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Объект.Ссылка);

						КонецЕсли;

					КонецЦикла;

				КонецЕсли;
			КонецЦикла;
		Исключение
			Сообщить("Не удалось зарегистрировать изменение для элемента " + Строка(Объект.Ссылка) + ". Элемент не будет отправлен на сайт Битрикс в режиме изенений.");
			Сообщить(ОписаниеОшибки()); 
		КонецПопытки;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&ИзменениеИКонтроль("СообщитьПодробно")
Процедура Док_СообщитьПодробно(пСобытие, ОсновныеПараметры, Логирование, СообщатьОбОшибке, ЗаписьВЖурналРегистрации)

	//#Если Клиент Тогда
	Сообщить(пСобытие);
	//#КонецЕсли

	Б_ОбщиеПроцедурыИФункцииСервер.ОтображениеСостояния(пСобытие);

	Если ЗаписьВЖурналРегистрации тогда
		ЗаписьЖурналаРегистрации("СобытияОбменаДанныхМодуляБитрикс", УровеньЖурналаРегистрации.Информация,,, пСобытие);
	КонецЕсли;

	Если СообщатьОбОшибке и НЕ ОсновныеПараметры = Неопределено Тогда

		ОсновныеПараметры.ЕстьКритичныеОшибкиВОбмене		= Истина;	
		ДобавитьИнформациюООшибкеВОбмене(ОсновныеПараметры.Ссылка, пСобытие);		

	КонецЕсли;

	Если Логирование и НЕ ОсновныеПараметры = Неопределено Тогда

		Если ОсновныеПараметры.ИмяФайлаЛога <> "" тогда

			лКодировка = КодировкаТекста.ANSI; 
			Если ОсновныеПараметры.КодировкаФайлаЛога = "ANSI" Тогда
				лКодировка = КодировкаТекста.ANSI; 
			ИначеЕсли ОсновныеПараметры.КодировкаФайлаЛога = "OEM" Тогда
				лКодировка = КодировкаТекста.OEM; 
			ИначеЕсли ОсновныеПараметры.КодировкаФайлаЛога = "UTF16" Тогда
				лКодировка = КодировкаТекста.UTF16; 
			ИначеЕсли ОсновныеПараметры.КодировкаФайлаЛога = "UTF8" Тогда
				лКодировка = КодировкаТекста.UTF8; 
			ИначеЕсли ОсновныеПараметры.КодировкаФайлаЛога = "Системная" Тогда
				лКодировка = КодировкаТекста.Системная; 
			КонецЕсли;	

			Текст = Новый ЗаписьТекста(ОсновныеПараметры.ИмяФайлаЛога, лКодировка,, Истина);
#Удаление
			Текст.ЗаписатьСтроку(Строка(ОсновныеПараметры.ДатаФормирования) + "--" + пСобытие);
#КонецУдаления
#Вставка
			Текст.ЗаписатьСтроку(Строка(ТекущаяДата()) + "--" + пСобытие);
#КонецВставки

			Текст.Закрыть(); 

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область Доработки

Процедура _ДобавитьПараметрыПротоколаОбменаВСтруктуру(СтруктураПараметров) Экспорт
	ДобавитьПараметрыПротоколаОбменаВСтруктуру(СтруктураПараметров);
КонецПроцедуры

Процедура _ДобавитьСтруктурыНастроекВПараметры(Параметры, СтруктураНастроек) Экспорт
	ДобавитьСтруктурыНастроекВПараметры(Параметры, СтруктураНастроек);
КонецПроцедуры

Процедура ЗарегистрироватьРасхожденияРегистраРаспределенияЗапасов(НаборСтарый,НаборНовый,МассивУзловТовары)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтарыйРегистр.Номенклатура КАК Номенклатура,
		|	СтарыйРегистр.НомерСтроки КАК НомерСтроки,
		|	СтарыйРегистр.Отгрузить + СтарыйРегистр.Резервировать + СтарыйРегистр.РезервироватьПоМереПоступления + СтарыйРегистр.КОбеспечениюБезРезерва + СтарыйРегистр.Поступило + СтарыйРегистр.ПоступитКДате + СтарыйРегистр.ПоставкаНаСогласовании + СтарыйРегистр.ЗакрытьГрафикПоступления + СтарыйРегистр.ЗакрытьГрафикОтгрузки КАК КонтрСумма
		|ПОМЕСТИТЬ ВР_СтарыйРегистр
		|ИЗ
		|	&СтарыйРегистр КАК СтарыйРегистр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НовыйРегистр.Номенклатура КАК Номенклатура,
		|	НовыйРегистр.НомерСтроки КАК НомерСтроки,
		|	НовыйРегистр.Отгрузить + НовыйРегистр.Резервировать + НовыйРегистр.РезервироватьПоМереПоступления + НовыйРегистр.КОбеспечениюБезРезерва + НовыйРегистр.Поступило + НовыйРегистр.ПоступитКДате + НовыйРегистр.ПоставкаНаСогласовании + НовыйРегистр.ЗакрытьГрафикПоступления + НовыйРегистр.ЗакрытьГрафикОтгрузки КАК КонтрСумма
		|ПОМЕСТИТЬ ВР_НовыйРегистр
		|ИЗ
		|	&НовыйРегистр КАК НовыйРегистр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ВР_НовыйРегистр.Номенклатура, ВР_СтарыйРегистр.Номенклатура) КАК Номенклатура
		|ИЗ
		|	ВР_СтарыйРегистр КАК ВР_СтарыйРегистр
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВР_НовыйРегистр КАК ВР_НовыйРегистр
		|		ПО ВР_СтарыйРегистр.Номенклатура = ВР_НовыйРегистр.Номенклатура
		|			И ВР_СтарыйРегистр.НомерСтроки = ВР_НовыйРегистр.НомерСтроки
		|ГДЕ
		|	ЕСТЬNULL(ВР_НовыйРегистр.КонтрСумма, 0) <> ЕСТЬNULL(ВР_СтарыйРегистр.КонтрСумма, 0)";
	
	Запрос.УстановитьПараметр("СтарыйРегистр",НаборСтарый.Выгрузить());
	Запрос.УстановитьПараметр("НовыйРегистр",НаборНовый.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, ВыборкаДетальныеЗаписи.Номенклатура);

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
